function checkLanguageText() {
    let text1, text2 , text3 , text4 , text5, text6;
    if (sessionStorage.getItem('language') === 'en') {
        text1 = "1";
        text2 = "2";
        text3 = "3";
        text4 = "4";
        text5 = "5";
        text6 = "6";

    } else {
        text1 = "Ο ιστότοπος “Helping Hand“ αποτελεί ένα εγχείρημα που υλοποιήθηκε απο μια ομάδα 4 φοιτητών του τμήματος" +
            " Πληροφορικής του ΑΠΘ.Διαμορφώθηκε στα πλαίσια μιας ομαδικής εργασίας,η οποία εκπονήθηκε για τις ανάγκες του" +
            " μαθήματος των Πληροφοριακών Συστημάτων Παγκόσμιου Ιστού.Η ομάδας μας απαρτίζεται απο τα ακόλουθα μέλη:τους" +
            "Αλέξανδρο Κανακάρη,Χαράλαμπο Μεταλληνό,Χρήστο Κούρο,Μιχάλη Αμασιαλίδη            ";
        text2 = "Απώτερος σκοπός της συγκεκριμένης διαδικτυακής εφαρμογής είναι η επίτευξη του 1ου στόχου που\n" +
            "                έχει θέσει ο Παγκόσμιος Οργανισμός Ηνωμένων Εθνών για την ανθρωπότητα,δηλαδή η εξάλειψη της παγκόσμιας\n" +
            "                φτώχειας.";
        text3 = "Αναμφίβολα,η φτώχεια αποτελεί ένα δεσμενές φαινόμενο,που παρά την καθοδική του τάση τα\n" +
            "                τελευταία χρόνια,\n" +
            "                μαστίζει ακόμη το πλανήτη σε τεράστιο βαθμό και δυσχεραίνει το βιοτικό επίπεδο εκατομμυρίων ανθρώπων.\n" +
            "                Ποικίλες πληθυσμιακές ομάδες που διαβιώνουν σε υποανάπτυκτες και τριτοκοσμικές χώρες δεν δύνανται να\n" +
            "                ικανοποιήσουν τις βασικές τους ανάγκες ,αντιμετωπίζουν προβλήματα υποσιτισμού ενώ παράλληλα στερούνται\n" +
            "                το θεμελιώδες δικαίωμα τους στην εκπαίδευση.";

        text4 = "Οι παραπάνω συνθήκες που επικρατούν στο κόσμο προβλημάτισαν ιδιαίτερα την ομάδα μας ,που αποφάσισε να\n" +
            "                αναπτύξει μια διαδικτυακή εφαρμογή για να παρουσιάσει τις επιπτώσεις της φτώχειας στο κόσμο και να\n" +
            "                προσφέρει λύσεις στα πρόβληματα που παρουσιάστηκαν.";

        text5 = "Ο ιστότοπος μας αποσκοπεί στην ενημέρωση και ευαισθητοποίηση του κοινού σχετικά με την παγκόσμια\n" +
            "                φτώχεια,στη προβολή πληροφοριών που αφορούν την εξέλιξη της στο κόσμο,στη παρουσίαση μη-κερδοσκοπικών\n" +
            "                οργανώσεων που συνεισφέρουν στη βελτίωση της κατάστασης και στη παροχή υπηρεσιών που διευκολύνουν τους\n" +
            "                ανθρώπους που το έχουν ανάγκη .Μέσα απο τη δράση μας επιδιώκουμε να βελτιώσουμε τις συνθήκες διαβίωσης\n" +
            "                των πληθυσμών που ταλανίζονται απο τη φτώχεια,να προσφέρουμε λύσεις σε καίρια προβλήματα που\n" +
            "                αντιμετωπίζουν και να διαμορφώσουμε ένα δίκαιο κόσμο με ίσες ευκαιρίες για όλους.";

        text6 = "Σας καλούμε να συνδράμετε στο έργο μας με το να πραγματοποίησετε εγγραφή στον ιστότοπο μας και να γίνετε\n" +
            "                ενεργά μέλη της προσπάθειας μας.Μαζί μπορούμε να τοποθετήσουμε τα θεμέλια για να διαμορφώσουμε ένα\n" +
            "                καλύτερο κόσμο!";
    }
    document.getElementById("text1").innerHTML = text1;
    document.getElementById("text2").innerHTML = text2;
    document.getElementById("text3").innerHTML = text3;
    document.getElementById("text4").innerHTML = text4;
    document.getElementById("text5").innerHTML = text5;
    document.getElementById("text6").innerHTML = text6;

}